{
  "studioName": "يجب أن يكون اسم الاستوديو سلسلة نصية ويحتوي على الأقل 5 أحرف",
  "studioNumber": "يجب أن يكون رقم الهاتف المحمول للإستوديو في تنسيق الهاتف المحمول المصري",
  "studioEmail": "يجب أن يكون البريد الإلكتروني للإستوديو بتنسيق صحيح",
  "desc": "يجب أن يكون الوصف سلسلة نصية ويحتوي على الأقل 10 أحرف",
  "location.lat": "يجب أن تكون خطوط العرض رقمًا عشريًا بين -90 و 90",
  "location.lng": "يجب أن تكون خطوط الطول رقمًا عشريًا بين -180 و 180",
  "searchKeywords": "يجب أن تكون كلمات البحث مصفوفة",
  "searchKeywords.*": "يجب أن تحتوي كلمة البحث على الأقل 3 أحرف",
  "pricePerHour": "يجب أن يكون سعر الساعة عددًا عشريًا موجبًا",
  "insurance": "يجب أن تكون قيمة التأمين عددًا عشريًا موجبًا",
  "showOnHome": "يجب أن تكون قيمة العرض في الصفحة الرئيسية قيمة منطقية",
  "category": "يجب أن يكون معرف الفئة صالحًا",
  "equipments": "يجب أن تحتوي قائمة المعدات على الأقل على عنصر واحد",
  "equipments.*.name": "يجب أن يكون اسم المعدة سلسلة نصية",
  "equipments.*.fees": "يجب أن تكون رسوم المعدة عددًا عشريًا موجبًا",
  "creatives": "يجب أن تكون الإبداعات مصفوفة",
  "creatives.*.creative": "يجب أن يكون معرف الإبداع صالحًا",
  "creatives.*.fees": "يجب أن تكون رسوم الإبداع عددًا عشريًا موجبًا",
  "invitedCreatives": "يجب أن تكون الإبداعات المدعوة مصفوفة",
  "invitedCreatives.*.phoneNumber": "يجب أن يكون رقم الهاتف كائنًا",
  "invitedCreatives.*.phoneNumber.number": "يجب أن يكون رقم الهاتف المحمول للإبداع المدعو في تنسيق الهاتف المحمول المصري",
  "invitedCreatives.*.fees": "يجب أن تكون رسوم الإبداع المدعو عددًا عشريًا موجبًا",
  "tags": "يجب أن تكون العلامات مصفوفة",
  "tags.*": "يجب أن تكون العلامة سلسلة نصية وتحتوي على الأقل 3 أحرف",
  "subCategory": "يجب أن يكون معرف الفئة الفرعية صالحًا",
  "projectId": "يجب أن يكون معرف المشروع صالحًا",
  "updateProjectId": "يجب أن يكون معرف المشروع للتحديث صالحًا",
  "updateStudioName": "يجب أن يكون اسم الاستوديو للتحديث سلسلة نصية ويحتوي على الأقل 5 أحرف",
  "updateStudioNumber": "يجب أن يكون رقم الهاتف المحمول للإستوديو للتحديث في تنسيق الهاتف المحمول المصري",
  "updateStudioEmail": "يجب أن يكون البريد الإلكتروني للإستوديو للتحديث بتنسيق صحيح",
  "updateDesc": "يجب أن يكون الوصف للتحديث سلسلة نصية ويحتوي على الأقل 10 أحرف",
  "updateLocation.lat": "يجب أن تكون خطوط العرض للتحديث رقمًا عشريًا بين -90 و 90",
  "updateLocation.lng": "يجب أن تكون خطوط الطول للتحديث رقمًا عشريًا بين -180 و 180",
  "updateSearchKeywords": "يجب أن تكون كلمات البحث للتحديث مصفوفة",
  "updateSearchKeywords.*": "يجب أن تحتوي كلمة البحث للتحديث على الأقل 3",
  "updatePricePerHour": "يجب أن يكون سعر الساعة للتحديث عددًا عشريًا موجبًا",
  "updateInsurance": "يجب أن تكون قيمة التأمين للتحديث عددًا عشريًا موجبًا",
  "updateShowOnHome": "يجب أن تكون قيمة العرض في الصفحة الرئيسية للتحديث قيمة منطقية",
  "updateCategory": "لا يجب تحديث الفئة",
  "updateEquipments": "لا يجب تحديث العتاد",
  "updateCreatives": "يجب أن تكون الإبداعات للتحديث مصفوفة",
  "updateInvitedCreatives": "يجب أن تكون الإبداعات المدعوة للتحديث مصفوفة",
  "updateTags": "يجب أن تكون العلامات للتحديث مصفوفة",
  "updateSubCategory": "يجب أن يكون معرف الفئة الفرعية للتحديث صالحًا",
  "equipmentId": "يجب أن يكون معرف المعدة صالحًا",
  "updateEquipmentId": "يجب أن يكون معرف المعدة للتحديث صالحًا",
  "addProjectId": "يجب أن يكون معرف المشروع للإضافة صالحًا",
  "name": "يجب أن يكون اسم المعدة سلسلة نصية",
  "fees": "يجب أن تكون الرسوم عددًا عشريًا موجبًا",
  "equipmentName": "يجب أن يكون اسم المعدة للإضافة سلسلة نصية",
  "equipmentFees": "يجب أن تكون الرسوم للإضافة عددًا عشريًا موجبًا",
  "deleteEquipmentId": "يجب أن يكون معرف المعدة للحذف صالحًا",
  "deleteProjectId": "يجب أن يكون معرف المشروع للحذف صالحًا",
  "pricePerHourFrom": "يجب أن يكون سعر الساعة من رقمي",
  "pricePerHourTo": "يجب أن يكون سعر الساعة إلى رقمي",
  "startDate": "يجب أن يكون تاريخ البدء في تنسيق ISO8601",
  "endDate": "يجب أن يكون تاريخ الانتهاء في تنسيق ISO8601",
  "limit": "يجب أن يكون الحد رقمًا صحيحًا وأكبر من 0",
  "page": "يجب أن يكون الصفحة رقمًا صحيحًا وأكبر من 0",
  "jobDetails": "يجب أن تكون تفاصيل العمل سلسلة نصية",
  "equipments.*": "يجب أن يكون معرف كل معدة صالحًا",
  "address": "يجب أن تكون العنوان سلسلة نصية",
  "location": "يجب أن تكون الموقع كائنًا",
  "bookingHours": "يجب أن تكون ساعات الحجز عددًا صحيحًا",
  "appointmentDate": "يجب أن يكون تاريخ الموعد بتنسيق ISO8601",
  "deadline": "يجب أن يكون الموعد النهائي بتنسيق ISO8601"
}
